org/The_Value_of_Information_for_Populations_in_Varying_Environments_by_Rivoire_and_Leibler_in_2011.org
#+setupfile: ./hugo_setup.org
#+hugo_slug: The_Value_of_Information_for_Populations_in_Varying_Environments_by_Rivoire_and_Leibler_in_2011
#+TITLE: The Value of Information for Populations in Varying Environments by Rivoire and Leibler in 2011
* 1 Introduction
* 2 Model
** Equation for the conditional mean population size $N_t$
** Two basic questions
** Three simplifying assumptions
** 
* 3 Fitness and optimization
* 4 Model under the assumptions A1, A2, and A3: Kelly's horse races
* 5 Relaxing A1: Causal constraints and inherited information
* 6 Relaxing A2: Individual stochasticity and distributed information
* 7 Relaxing A3: General multiplication rates and functional information
* 8 Generalizations
* 9 Conclusion
* Appendix A: Definition and properties of the model
* Appendix B: Growth rate as a measure of fitness
* Appendix C: Rudiments of information theory
* Appendix D: Analytically solvable models
* Appendix E: A solvable model in non IID environments
* Appendix F: Proof of the entropic bound
* Appendix G: Proof of the maladjustment bound
* Appendix H: Perturbative approximation
