content/posts/The_Value_of_Information_for_Populations_in_Varying_Environments_by_Rivoire_and_Leibler_in_2011.md
+++
title = "The Value of Information for Populations in Varying Environments by Rivoire and Leibler in 2011"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:36:09-04:00
slug = "The_Value_of_Information_for_Populations_in_Varying_Environments_by_Rivoire_and_Leibler_in_2011"
draft = false
+++

## 1 Introduction {#1-introduction}


## 2 Model {#2-model}


### Equation for the conditional mean population size \\(N\_t\\) {#equation-for-the-conditional-mean-population-size--n-t}


### Two basic questions {#two-basic-questions}


### Three simplifying assumptions {#three-simplifying-assumptions}


###  {#}


## 3 Fitness and optimization {#3-fitness-and-optimization}


## 4 Model under the assumptions A1, A2, and A3: Kelly's horse races {#4-model-under-the-assumptions-a1-a2-and-a3-kelly-s-horse-races}


## 5 Relaxing A1: Causal constraints and inherited information {#5-relaxing-a1-causal-constraints-and-inherited-information}


## 6 Relaxing A2: Individual stochasticity and distributed information {#6-relaxing-a2-individual-stochasticity-and-distributed-information}


## 7 Relaxing A3: General multiplication rates and functional information {#7-relaxing-a3-general-multiplication-rates-and-functional-information}


## 8 Generalizations {#8-generalizations}


## 9 Conclusion {#9-conclusion}


## Appendix A: Definition and properties of the model {#appendix-a-definition-and-properties-of-the-model}


## Appendix B: Growth rate as a measure of fitness {#appendix-b-growth-rate-as-a-measure-of-fitness}


## Appendix C: Rudiments of information theory {#appendix-c-rudiments-of-information-theory}


## Appendix D: Analytically solvable models {#appendix-d-analytically-solvable-models}


## Appendix E: A solvable model in non IID environments {#appendix-e-a-solvable-model-in-non-iid-environments}


## Appendix F: Proof of the entropic bound {#appendix-f-proof-of-the-entropic-bound}


## Appendix G: Proof of the maladjustment bound {#appendix-g-proof-of-the-maladjustment-bound}


## Appendix H: Perturbative approximation {#appendix-h-perturbative-approximation}
